Repository: bgonzalezn/PRTT-bpgn
Catalog: tm/FRC Introductory Presentation  04MAR_16.tmx
Source language: en
Languages: es

source: What are the consequences of not following the Fatal Risk Controls?
es: ¿Cuáles son las consecuencias de no respetar los controles de riesgos fatales?

source: While conducting level one earthworks testing in South Australia, Peter was hit by a scraper.
es: Mientras hacía pruebas de movimientos de tierra en el sur de Australia, Peter fue golpeado por un escarificador.

source: Who has experienced, or been involved in a near miss involving this control?
es: ¿Quién ha tenido una experiencia directa o indirecta con una cuasi pérdida relacionada con este control?

source: Why create Fatal Risk Controls?
es: ¿Por qué crear controles de riesgos fatales?

source: Why does safety matter to me?
es: ¿Por qué la seguridad es importante para mí?

source: Worker was killed by reversing dump truck on construction site.
es: Trabajador muerto por camión tolva en reversa en sitio de construcción.

source: Working around Heavy and Mobile Equipment
es: Trabajo alrededor de maquinaria móvil y pesada

source: Working at Heights
es: Trabajo en altura

source: Working in a Century Zinc project in NW Queensland.
es: Trabajaba en el proyecto Century Zinc en el noroeste de Queensland (Australia).

source: Zero Harm and Zero Fatality
es: Cero daño y cero fatalidades

source: almost hit
es: cuasi atropello

source: https://www.youtube.com/watch?v=-O-LHgTRCvU - this video provides an overview of why focusing on the bottom of the pyramid will not prevent fatalities – I would not suggest showing this video, as I believe it will only confuse attendees with acronyms and theories they do not need to know.
es: https://www.youtube.com/watch?v=-O-LHgTRCvU - este video presenta una descripción general del porqué centrarse en la parte inferior de la pirámide no evita fatalidades. No sugiero mostrar el video, porque creo que solo confundiría a los asistentes con siglas y teorías que no necesitan saber.

source: to vibratory roller – nuclear densometer
es: de rodillo vibratorio – densímetro nuclear

source: “ Maybe when zero harm is communicated across an organization, maybe the interpretation of zero harm doesn’t land on people the right way all the time, and maybe that focus on zero harm, and the communication that does or doesn’t go with it, could lead to a disconnect in the operations.”
es: “Quizá al comunicar a la organización que hay cero daño, quizá la interpretación de cero daño no le llega a la gente siempre de la manera correcta y quizá ese foco en el cero daño y la comunicación que trae o no trae aparejada podría provocar un desajuste en las operaciones”.

source: “When we are willing to work around potentially fatal hazards without proper Controls…..a fatality is only an incident away…..we have proven this 8 times in the past 35 years.”
es: “Cuando queremos trabajar en torno a peligros potencialmente fatales sin los controles adecuados… una fatalidad está apenas a un incidente de distancia… lo hemos demostrado 8 veces en los últimos 35 años.”
